---
kind: method
id: M:Autodesk.Revit.DB.CitySet.Contains(Autodesk.Revit.DB.City)
source: html/5a585ab7-7610-6b22-21d3-d9e30a70d3ba.htm
---
# Autodesk.Revit.DB.CitySet.Contains Method

Tests for the existence of a city within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	City item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.City`) - The city to be searched for.

## Returns
The Contains method returns True if the city is within the set, otherwise False.